; domain
(define (domain manito)

    (:requirements :strips :typing)

    (:types
      ; TODO: los definimos juntos
      item ; algo que el brazo puede tomar
      zone ; zona donde se encuentra un item
    )
    
    (:predicates
    (at ?o - item ?z - zone ) ; el item ?o está en la zona ?z
    (clean ?z - zone) ; la zona ?z está libre, no tiene nada encima
    (clear ?o - item) ; el item ?o no tiene nada apilado encima
    (hand-empty) ; el gripper del brazo está vacío
    (hand-pick ?o - item) ; el brazo está sujetando el item ?o
    (on ?o - item ?p - item) ; el item ?o está apilado sobre el item ?p
    (stackable ?o - item) ; el item ?o admite que se apile algo sobre él
    )

    ; --- acciones ---

    (:action pick-up
      ; agarrar un item ?o que está suelto sobre la zona ?z
      :parameters (?o - item ?z - zone)
      :precondition (and (at ?o ?z) (clear ?o) (hand-empty))
      :effect (and
        (not (at ?o ?z))
        (not (hand-empty))
        (hand-pick ?o)
        (clean ?z)
      )
    )

    (:action put-down
      ; soltar el item que se tiene en la mano sobre una zona libre ?z
      :parameters (?o - item ?z - zone)
      :precondition (and (hand-pick ?o) (clean ?z))
      :effect (and
        (not (hand-pick ?o))
        (hand-empty)
        (at ?o ?z)
        (not (clean ?z))
        (clear ?o)
      )
    )

    (:action stack
      ; apilar el item que se tiene en la mano ?o sobre otro item ?p
      :parameters (?o - item ?p - item)
      :precondition (and (hand-pick ?o) (clear ?p) (stackable ?p))
      :effect (and
        (not (hand-pick ?o))
        (hand-empty)
        (on ?o ?p)
        (not (clear ?p))
        (clear ?o)
      )
    )

    (:action unstack
      ; agarrar el item ?o que está apilado encima de ?p
      :parameters (?o - item ?p - item)
      :precondition (and (on ?o ?p) (clear ?o) (hand-empty))
      :effect (and
        (not (on ?o ?p))
        (clear ?p)
        (not (hand-empty))
        (hand-pick ?o)
      )
    )

  )

; problem
(define (problem problem_8)
  (:domain manito)
  (:objects
    A R G B - item
    zona-a zona-r zona-g zona-b zona-derecha - zone
  )
  (:init
    (at A zona-a) (at R zona-r) (at G zona-g) (at B zona-b)
    (clean zona-derecha)
    (clear A) (clear R) (clear G) (clear B)
    (hand-empty)
    (stackable A) (stackable R) (stackable G) (stackable B)
  )
  (:goal
    (and (on B G) (on R A) (at G zona-derecha) (at A zona-b))
  )
)

; plan
1. (pick-up g zona-g)
   deleted: (at g zona-g) (hand-empty)
   added: (hand-pick g) (clean zona-g)
   goals met: 0 of 4
2. (put-down g zona-derecha)
   deleted: (hand-pick g) (clean zona-derecha)
   added: (hand-empty) (at g zona-derecha)
   goals met: 1 of 4
3. (pick-up b zona-b)
   deleted: (at b zona-b) (hand-empty)
   added: (hand-pick b) (clean zona-b)
   goals met: 1 of 4
4. (stack b g)
   deleted: (hand-pick b) (clear g)
   added: (hand-empty) (on b g)
   goals met: 2 of 4
5. (pick-up a zona-a)
   deleted: (at a zona-a) (hand-empty)
   added: (hand-pick a) (clean zona-a)
   goals met: 2 of 4
6. (put-down a zona-b)
   deleted: (hand-pick a) (clean zona-b)
   added: (hand-empty) (at a zona-b)
   goals met: 3 of 4
7. (pick-up r zona-r)
   deleted: (at r zona-r) (hand-empty)
   added: (hand-pick r) (clean zona-r)
   goals met: 3 of 4
8. (stack r a)
   deleted: (hand-pick r) (clear a)
   added: (hand-empty) (on r a)
   goals met: 4 of 4
